; domain
(define (domain driverlog)
  (:requirements :strips)
  (:types location locatable - object
  	  truck driver package - locatable)

  (:predicates 	(at ?lt - locatable ?loc - location)
		(in ?p - package ?t - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck))


(:action LOAD-TRUCK
  :parameters (?o1 - package ?o2 - truck ?o3 - location)
  :precondition (and (at ?o2 ?o3) (at ?o1 ?o3))
  :effect (and (not (at ?o1 ?o3)) (in ?o1 ?o2)))

(:action UNLOAD-TRUCK
  :parameters (?o1 - package ?o2 - truck ?o3 - location)
  :precondition (and (at ?o2 ?o3) (in ?o1 ?o2))
  :effect (and (not (in ?o1 ?o2)) (at ?o1 ?o3)))


(:action BOARD-TRUCK
  :parameters (?o1 - driver ?o2 - truck ?o3 - location)
  :precondition (and (at ?o2 ?o3) (at ?o1 ?o3) (empty ?o2))
  :effect (and (not (at ?o1 ?o3)) (driving ?o1 ?o2) (not (empty ?o2))))

(:action DISEMBARK-TRUCK
  :parameters (?o1 - driver ?o2 - truck ?o3 - location)
  :precondition (and (at ?o2 ?o3) (driving ?o1 ?o2))
  :effect (and (not (driving ?o1 ?o2)) (at ?o1 ?o3) (empty ?o2)))


(:action DRIVE-TRUCK
  :parameters (?o1 - truck ?o2 - location ?o3 - location ?o4 - driver)
  :precondition (and (at ?o1 ?o2) (driving ?o4 ?o1) (link ?o2 ?o3))
  :effect (and (not (at ?o1 ?o2)) (at ?o1 ?o3)))

(:action WALK
  :parameters (?o1 - location ?o2 - location ?o3 - driver)
  :precondition (and (at ?o3 ?o1) (path ?o1 ?o2))
  :effect (and (not (at ?o3 ?o1)) (at ?o3 ?o2)))

)

; problem
(define (problem dlog-2-2-3)
  (:domain driverlog)
  (:objects truck1 -  truck driver2 -  driver driver1 -  driver package1 -  package truck2 -  truck package3 -  package package2 -  package s0 -  location s1 -  location s2 -  location p0-1 -  location p0-2 -  location p1-0 -  location p2-1 -  location )
  (:init (at truck1 s2) (link s1 s2) (path s1 p0-1) (at truck2 s2) (at package2 s1) (path p0-1 s1) (link s0 s2) (path s0 p0-1) (path s0 p0-2) (path p2-1 s1) (path s2 p0-2) (path s2 p2-1) (path p2-1 s2) (empty truck2) (empty truck1) (link s2 s0) (path p0-2 s2) (link s0 s1) (at package3 s1) (link s1 s0) (link s2 s1) (path s1 p2-1) (path p0-2 s0) (path p0-1 s0) (in package1 truck2) (at driver1 s2) (at driver2 s2) )
  (:goal (and (link s1 s2)(path s1 p0-1)(at truck2 s2)(at package2 s1)(path p0-1 s1)(link s0 s2)(path s0 p0-1)(path s0 p0-2)(path p2-1 s1)(path s2 p0-2)(path s2 p2-1)(path p2-1 s2)(link s2 s0)(path p0-2 s2)(link s0 s1)(at package3 s1)(link s1 s0)(link s2 s1)(path s1 p2-1)(path p0-2 s0)(path p0-1 s0)(driving driver1 truck1)(driving driver2 truck2)(at truck1 s0)(in package1 truck2)(not (in package1 truck1))(not (in package2 truck1))(not (in package2 truck2))(not (in package3 truck1))(not (in package3 truck2))(not (driving driver1 truck2))(not (driving driver2 truck1))(not (link s0 s0))(not (link s0 p0-1))(not (link s0 p0-2))(not (link s0 p1-0))(not (link s0 p2-1))(not (link s1 s1))(not (link s1 p0-1))(not (link s1 p0-2))(not (link s1 p1-0))(not (link s1 p2-1))(not (link s2 s2))(not (link s2 p0-1))(not (link s2 p0-2))(not (link s2 p1-0))(not (link s2 p2-1))(not (link p0-1 s0))(not (link p0-1 s1))(not (link p0-1 s2))(not (link p0-1 p0-1))(not (link p0-1 p0-2))(not (link p0-1 p1-0))(not (link p0-1 p2-1))(not (link p0-2 s0))(not (link p0-2 s1))(not (link p0-2 s2))(not (link p0-2 p0-1))(not (link p0-2 p0-2))(not (link p0-2 p1-0))(not (link p0-2 p2-1))(not (link p1-0 s0))(not (link p1-0 s1))(not (link p1-0 s2))(not (link p1-0 p0-1))(not (link p1-0 p0-2))(not (link p1-0 p1-0))(not (link p1-0 p2-1))(not (link p2-1 s0))(not (link p2-1 s1))(not (link p2-1 s2))(not (link p2-1 p0-1))(not (link p2-1 p0-2))(not (link p2-1 p1-0))(not (link p2-1 p2-1))(not (path s0 s0))(not (path s0 s1))(not (path s0 s2))(not (path s0 p1-0))(not (path s0 p2-1))(not (path s1 s0))(not (path s1 s1))(not (path s1 s2))(not (path s1 p0-2))(not (path s1 p1-0))(not (path s2 s0))(not (path s2 s1))(not (path s2 s2))(not (path s2 p0-1))(not (path s2 p1-0))(not (path p0-1 s2))(not (path p0-1 p0-1))(not (path p0-1 p0-2))(not (path p0-1 p1-0))(not (path p0-1 p2-1))(not (path p0-2 s1))(not (path p0-2 p0-1))(not (path p0-2 p0-2))(not (path p0-2 p1-0))(not (path p0-2 p2-1))(not (path p1-0 s0))(not (path p1-0 s1))(not (path p1-0 s2))(not (path p1-0 p0-1))(not (path p1-0 p0-2))(not (path p1-0 p1-0))(not (path p1-0 p2-1))(not (path p2-1 s0))(not (path p2-1 p0-1))(not (path p2-1 p0-2))(not (path p2-1 p1-0))(not (path p2-1 p2-1))(not (empty truck1))(not (empty truck2)))))

; plan
1. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 111 of 114
2. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 113 of 114
3. (unload-truck package1 truck2 s2)
   deleted: (in package1 truck2)
   added: (at package1 s2)
   goals met: 112 of 114
4. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 113 of 114
5. (load-truck package1 truck2 s2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 114 of 114
